In [15]:
import pandas as pd
import numpy as np

In [3]:
a=pd.read_csv("ML+C9 (1).csv")

,YearsOfExp,CompanyName1,Title1,FieldOfStudy1,Major1,Gender,City,State
0,6,Siemens Gamesa,Senior System Engineer,Electronics and Communication,B.E,Male,Bengaluru,Karnataka
1,10,pankajkmr@gmail.com,0,MSc,Post Diploma in Computer Engg,0,Bengaluru,Karnataka
2,10,allianz,0,Electronics & Communication Engineering,B.Tech,0,Trivandrum,Kerala
3,10,Wipro Technologies,SAP Practice Global Automation(Artificial Inte...,Mechanical Engineering,B.Tech,Male,"Hyderabad, Telangana, India",Telangana
4,0,Cisco Systems,0,Computer Science,0,0,Bengaluru,Karnataka

In [20]:
a.index

RangeIndex(start=0, stop=277, step=1)

In [22]:
(16/277)*100

5.776173285198556

In [34]:
a[a['Gender'] !='0'].groupby(['Gender'])['Gender'].count()

Gender
Female     6
Male      50
Name: Gender, dtype: int64

###### 6/

In [35]:
6/56

0.10714285714285714

In [36]:
citi=['Bengaluru', 'Bangalore']

In [47]:
len(a[a['City'].isin(citi)])/len(a)*100

40.794223826714806

In [57]:
a.groupby('City')['City'].count().sort_values(ascending=False)

City
Bengaluru                      99
Hyderabad                      25
0                              18
Pune                           18
Bangalore                      14
Mumbai                         11
Gurugram                        9
New Delhi                       9
Chennai                         7
Kolkata                         5
Delhi                           4
Kochi                           3
Noida                           3
Bangkok                         3
Trivandrum                      2
San Jose                        2
Thiruvananthapuram              2
Ghaziabad                       2
Dubai                           1
Kanpur                          1
Ernakulam                       1
Fujairah                        1
Coimbatore                      1
Chennai, Tamil Nadu, India      1
Hawally                         1
Bhubaneswar                     1
BANGALORE                       1
Hyderabad, Telangana, India     1
Jaipur                          1
Jharsuguda                      1
Jubilee Hills                   1
Ajmer                           1
Chandigarh                      1
pune                            1
Kitchener                       1
Kota                            1
Woodbridge Township             1
West Chester                    1
Vellore                         1
Varanasi                        1
Sydney NSW, Australia           1
Singapore                       1
Salem                           1
Philadelphia                    1
Patna                           1
Others                          1
Other                           1
New York                        1
Nellore                         1
Navi Mumbai                     1
Nahan                           1
Mysuru                          1
Mysore                          1
Mumbai, Maharashtra, India      1
Luton                           1
London                          1
dubai                           1
Kottayam                        1
Name: City, dtype: int64

In [54]:
b.describe()

count    58.000000
mean      4.758621
std      13.515826
min       1.000000
25%       1.000000
50%       1.000000
75%       2.000000
max      99.000000
Name: City, dtype: float64